# 4.6. Combining and exporting data: Part 2<br>
### ('orders_products_combined' and products_clean')

# List of contents:
## 1. Import libraries
## 2. Import datasets
## 3. Check the shape
## 4. Combine dataframes 
## 5. Confirm results with the merge flag
## 6. Export dataframe as 'orders_products_merged'
#

## 1. Import libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 2. Import datasets

### - orders_products_combined

In [2]:
# Create path variable
path = r'C:\Users\marta\OneDrive\Documents\2023-09-18 Instacart Basket Analysis'

In [3]:
# Import orders_products_combined dataset
df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# Check the output
df_ords_prods_combined.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [5]:
# Removing '_merge' column from df_ords_prods_combined
df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

### - products_clean

In [6]:
# Import products_clean dataset
df_prods_clean = pd.read_csv(r'C:\Users\marta\OneDrive\Documents\2023-09-18 Instacart Basket Analysis\02 Data\Prepared Data\products_clean.csv', index_col = False)

In [7]:
# Removing 'Unnamed: 0' column from df_prods_clean
df_prods_clean = df_prods_clean.drop(columns = ['Unnamed: 0'])

In [8]:
# Check the output
df_prods_clean.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

## 3. Check the shape

In [9]:
# Check the shape of df_ords_prods_combined
df_ords_prods_combined.shape

(32434489, 9)

In [10]:
# Check the shape of df_prods_clean
df_prods_clean.shape

(49670, 5)

## 4. Combine dataframes

In [11]:
# Merge df_ords_prods_combined and df_prods_clean
df_ords_prods_merged = df_ords_prods_combined.merge(df_prods_clean, on = 'product_id', indicator = True)

Two dataframes were merged using inner join, which means observations that didn't have matching values under 'product_id' column were excluded from new merged dataframe.

In [12]:
# Check the output
df_ords_prods_merged.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [13]:
# Check the shape
df_ords_prods_merged.shape

(32399732, 14)

## 5. Confirm results with the merge flag

In [14]:
# Frequency of values under '_merge' column
df_ords_prods_merged['_merge'].value_counts()

_merge
both          32399732
left_only            0
right_only           0
Name: count, dtype: int64

## 6. Export dataframe as 'orders_products_merged'

In [15]:
# Export df_ords_prods_merged in pickle format
df_ords_prods_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))